#Область ОписаниеПеременных

&НаКлиенте 
Перем Переменные;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура РинатНаСервере()
	
	мСтр = "Лев,Дева,Весы,Итд";
	мРез = ph_РасширенныеВозможности.ПреобразоватьСтрокуВМассив(мСтр);
	Для Каждого Элемент Из мРез Цикл
		Сообщить(Элемент);
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
 
&НаКлиенте
Процедура Andrey(Команда)
	ОбщийМодульКлиент.ИзОбработки();
КонецПроцедуры

&НаКлиенте
Процедура Ринат(Команда)
	РинатНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Сергей(Команда)
	СергейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СколькоБудет(Команда)
	
	ОчиститьСообщения();
	
	Переменные = Новый Структура("x,y", 0,0);
    
    СгенерироватьЗначенияПеременных(Переменные);
    
    ТекстВопроса = СтрШаблон(НСтр("ru = 'Сколько будет %1 умножить на %2?' "), Переменные.x, Переменные.y);
    
    ПоказатьПредупреждение(Новый ОписаниеОповещения("ПоказатьОтвет", ЭтотОбъект), ТекстВопроса, 7);
             
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СгенерироватьЗначенияПеременных(Переменные)
	
	ph_РасширенныеВозможности.СгенерироватьЗначенияПеременных(Переменные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтвет(Результат) Экспорт
	
	ПоказатьПредупреждение(, Переменные.x * Переменные.y, 20, "Правильный ответ:");
    	
КонецПроцедуры

&НаСервере
Процедура СергейНаСервере()
	ph_РасширенныеВозможности.ПередатьПривет("Сергей");
КонецПроцедуры

#КонецОбласти
