#Область ОбработчикиСобытийФормы

&НаСервере
Процедура РинатНаСервере()
	
	мСтр = "Лев,Дева,Весы,Итд";
	мРез = ph_РасширенныеВозможности.ПреобразоватьСтрокуВМассив(мСтр);
	Для Каждого Элемент Из мРез Цикл
		Сообщить(Элемент);
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
 
&НаКлиенте
Процедура Andrey(Команда)
	ОбщийМодульКлиент.ИзОбработки();
КонецПроцедуры

&НаКлиенте
Процедура Ринат(Команда)
	РинатНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Сергей(Команда)
	СергейНаСервере();
КонецПроцедуры
#КонецОбласти
&НаСервере
Процедура СергейНаСервере()
	ph_РасширенныеВозможности.ПередатьПривет("Сергей");
КонецПроцедуры


