#Область ПрограммныйИнтерфейс

Процедура HelloWorld() Экспорт
	Сообщить("Hello World!");
	Return;
	qwe=qwe;
	рез = Новый Массив();
	asd=asd;
    н=н+1;
    
КонецПроцедуры

Функция ПреобразоватьСтрокуВМассив(мСтр) Экспорт
	
	мРез = СтрРазделить(мСтр,",");
	
	Возврат мРез;
	
КонецФункции

Процедура ПередатьПривет(Имя) Экспорт
	Сообщить("Привет " + Имя);
КонецПроцедуры

//Генерирует значение переменных "x" и "y"
// Параметры:
//  Переменные - Структура - структура с переменными "x" и "y"
Процедура СгенерироватьЗначенияПеременных(Переменные) Экспорт
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	Переменные.Вставить("x", ГСЧ.СлучайноеЧисло(0, 30));
	Переменные.Вставить("y", ГСЧ.СлучайноеЧисло(0, 30));
	
КонецПроцедуры

#КонецОбласти
