#Область ПрограммныйИнтерфейс

Процедура HelloWorld() Экспорт
	Сообщить("Hello World!");
	Return;
	qwe=qwe;
	рез = Новый Массив();
	asd=asd;
    н=н+1;
    
КонецПроцедуры

Функция ПреобразоватьСтрокуВМассив(мСтр) Экспорт
	
	мРез = СтрРазделить(мСтр,",");
	
	Возврат мРез;
	
КонецФункции

Процедура ПередатьПривет(Имя) Экспорт
	Сообщить("Привет " + Имя);
КонецПроцедуры

//Генерирует значение переменных "x" и "y"
// Параметры:
//  Переменные - Структура - структура с переменными "x" и "y"
Процедура СгенерироватьЗначенияПеременных(Переменные) Экспорт
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	Переменные.Вставить("x", ГСЧ.СлучайноеЧисло(0, 30));
	Переменные.Вставить("y", ГСЧ.СлучайноеЧисло(0, 30));
	
КонецПроцедуры

Функция ВернутьДеньНедели(Параметры) Экспорт
	ДеньНед = ДеньНедели(ТекущаяДата());
	Если ДеньНед = 1 Тогда
		ДеньНеделиРасшифровка = "Понедельник, собираемся с мыслями";
	ИначеЕсли ДеньНед = 2 Тогда
		ДеньНеделиРасшифровка = "Вторник, ебашим";
	ИначеЕсли ДеньНед = 3 Тогда
		ДеньНеделиРасшифровка = "Среда, это маленькая пятница... маленечко бухаем";
	ИначеЕсли ДеньНед = 4 Тогда
		ДеньНеделиРасшифровка = "Четверг, ебашим";
	ИначеЕсли ДеньНед = 5 Тогда
		ДеньНеделиРасшифровка = "Пятница, бухаем - газ в палас";
	ИначеЕсли ДеньНед = 6 Тогда
		ДеньНеделиРасшифровка = "Суббота, продолжаем";
	ИначеЕсли ДеньНед = 7 Тогда
		ДеньНеделиРасшифровка = "Воскресенье, отходим";
	КонецЕсли;
	Возврат ДеньНеделиРасшифровка;
КонецФункции
#КонецОбласти
